IDEA Open Model
SteelDiagramType Enumeration
Compatible with IDEA StatiCa v 10.1
 Steel stress-strain diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public enum SteelDiagramType
Public Enumeration SteelDiagramType
public enum class SteelDiagramType
Members
Member name | Value | Description
Bilinear | 0 |  Billinear
DefinedByUser | 5 |  Defined by user
See Also
Reference
IdeaRS.OpenModel.Material Namespace